app/src/main/assets/soap/request_bipro480-partner.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://www.w3.org/2011/03/ws-enu" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:bas="http://www.bipro.net/namespace/basis" xmlns:par="http://www.bipro.net/namespace/kontext/partner" xmlns:all="http://www.bipro.net/namespace/allgemein">
${soapHeader}
    <soapenv:Body>
        <ws:Enumerate>
            <ws:NewContext>
                <ws:Filter Dialect="http://www.bipro.net/namespace/kontext/partner">
                    <par:Filter xsi:type="par:CT_Partnersuche">
                        <!--#IFDEF ${name}--><par:Name>${name}</par:Name><!--/#IFDEF-->
                        <!--#IFDEF ${vorname}--><par:Vorname>${vorname}</par:Vorname><!--/#IFDEF-->
                    <!--#IFDEF ${strasse}--><par:Strasse>${strasse}</par:Strasse><!--/#IFDEF-->
                    <!--#IFDEF ${ort}--><par:Ort>${ort}</par:Ort><!--/#IFDEF-->
                    <!--#IFDEF ${plz}--><par:Postleitzahl>${plz}</par:Postleitzahl><!--/#IFDEF-->
                    <!--#IFDEF ${vsnr}--><par:Versicherungsscheinnummer>${vsnr}</par:Versicherungsscheinnummer><!--/#IFDEF-->
                    </par:Filter>
                </ws:Filter>
            </ws:NewContext>
            <ws:MaxItems>100</ws:MaxItems>
        </ws:Enumerate>
    </soapenv:Body>
</soapenv:Envelope>